STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Ota_Server/STM32_WPAN/App/app_thread.c
/*************************************************************
 *
 * LOCAL FUNCTIONS
 *
 *************************************************************/

/**
 * @brief Thread initialization.
 * @param  None
 * @retval None
 */
static void APP_THREAD_DeviceConfig(void)
{
  otError error;
  error = otInstanceErasePersistentInfo(NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_ERASE_PERSISTENT_INFO,error);
  }
  otInstanceFinalize(NULL);
  otInstanceInitSingle();
  error = otSetStateChangedCallback(NULL, APP_THREAD_StateNotif, NULL);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_STATE_CB,error);
  }
  error = otLinkSetChannel(NULL, C_CHANNEL_NB);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_CHANNEL,error);
  }
  error = otLinkSetPanId(NULL, C_PANID);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_SET_PANID,error);
  }
  error = otIp6SetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_IPV6_ENABLE,error);
  }
  error = otThreadSetEnabled(NULL, true);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_START,error);
  }

  /* USER CODE BEGIN DEVICECONFIG */
  /* Start the COAP server */
  error = otCoapStart(NULL, OT_DEFAULT_COAP_PORT);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_START,error);
  }
  /* Add COAP resources */
  error = otCoapAddResource(NULL, &OT_RessourceFuotaProvisioning);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
  error = otCoapAddResource(NULL, &OT_RessourceFuotaSend);
  if (error != OT_ERROR_NONE)
  {
    APP_THREAD_Error(ERR_THREAD_COAP_ADD_RESSOURCE,error);
  }
  /* USER CODE END DEVICECONFIG */
}

/**
 * @brief Thread notification when the state changes.
 * @param  aFlags  : Define the item that has been modified
 *         aContext: Context
 *
 * @retval None
 */
static void APP_THREAD_StateNotif(uint32_t NotifFlags, void *pContext)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(pContext);

  /* USER CODE BEGIN APP_THREAD_STATENOTIF */
  
  /* USER CODE END APP_THREAD_STATENOTIF */

  if ((NotifFlags & (uint32_t)OT_CHANGED_THREAD_ROLE) == (uint32_t)OT_CHANGED_THREAD_ROLE)
  {
    switch (otThreadGetDeviceRole(NULL))
    {
    case OT_DEVICE_ROLE_DISABLED:
      /* USER CODE BEGIN OT_DEVICE_ROLE_DISABLED */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END OT_DEVICE_ROLE_DISABLED */
      break;
    case OT_DEVICE_ROLE_DETACHED:
      /* USER CODE BEGIN OT_DEVICE_ROLE_DETACHED */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END OT_DEVICE_ROLE_DETACHED */
      break;
    case OT_DEVICE_ROLE_CHILD:
      /* USER CODE BEGIN OT_DEVICE_ROLE_CHILD */
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      /* USER CODE END OT_DEVICE_ROLE_CHILD */
      break;
    case OT_DEVICE_ROLE_ROUTER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_ROUTER */
      BSP_LED_Off(LED2);
      BSP_LED_On(LED3);
      /* USER CODE END OT_DEVICE_ROLE_ROUTER */
      break;
    case OT_DEVICE_ROLE_LEADER :
      /* USER CODE BEGIN OT_DEVICE_ROLE_LEADER */
      BSP_LED_On(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END OT_DEVICE_ROLE_LEADER */
      break;
    default:
      /* USER CODE BEGIN DEFAULT */
      BSP_LED_Off(LED2);
      BSP_LED_Off(LED3);
      /* USER CODE END DEFAULT */
      break;
    }
  }
}

/**
  * @brief  Warn the user that an error has occurred.In this case,
  *         the LEDs on the Board will start blinking.
  *
  * @param  pMess  : Message associated to the error.
  * @param  ErrCode: Error code associated to the module (OpenThread or other module if any)
  * @retval None
  */
static void APP_THREAD_TraceError(const char * pMess, uint32_t ErrCode)
{
  /* USER CODE BEGIN TRACE_ERROR */
  APP_DBG("**** Fatal error = %s (Err = %d)", pMess, ErrCode);
  while(1U == 1U)
  {
    BSP_LED_Toggle(LED1);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED2);
    HAL_Delay(500U);
    BSP_LED_Toggle(LED3);
    HAL_Delay(500U);
  }
  /* USER CODE END TRACE_ERROR */
}

/**
 * @brief Check if the Coprocessor Wireless Firmware loaded supports Thread
 *        and display associated informations
 * @param  None
 * @retval None
 */
static void APP_THREAD_CheckWirelessFirmwareInfo(void)
{
  WirelessFwInfo_t wireless_info_instance;
  WirelessFwInfo_t* p_wireless_info = &wireless_info_instance;

  if (SHCI_GetWirelessFwInfo(p_wireless_info) != SHCI_Success)
  {
    APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
  }
  else
  {
    APP_DBG("**********************************************************");
    APP_DBG("WIRELESS COPROCESSOR FW:");
    /* Print version */
    APP_DBG("VERSION ID = %d.%d.%d", p_wireless_info->VersionMajor, p_wireless_info->VersionMinor, p_wireless_info->VersionSub);

    switch(p_wireless_info->StackType)
    {
    case INFO_STACK_TYPE_THREAD_FTD :
      APP_DBG("FW Type : Thread FTD");
      break;
    case INFO_STACK_TYPE_THREAD_MTD :
      APP_DBG("FW Type : Thread MTD");
      break;
    case INFO_STACK_TYPE_BLE_THREAD_FTD_STATIC :
      APP_DBG("FW Type : Static Concurrent Mode BLE/Thread");
      break;
    default :
      /* No Thread device supported ! */
      APP_THREAD_Error((uint32_t)ERR_THREAD_CHECK_WIRELESS, (uint32_t)ERR_INTERFACE_FATAL);
      break;
    }
    APP_DBG("**********************************************************");
  }
}
/* USER CODE BEGIN FD_LOCAL_FUNCTIONS */
/**
 * @brief Send a CoAP request with defined parameters.
 *
 * @param[in]  pCoapRessource   A pointer to a otCoapResource.
 * @param[in]  CoapType         otCoapType.
 * @param[in]  otCoapCode       otCoapCode.
 * @param[in]  Ip6Address       A pointer to otIp6Address.
 * @param[in]  StringAddress    A pointer to a NULL-terminated string representing the address. Example: "FF03::1" for Multicast.
 * @param[in]  CoapAddressType  Decide to use IP6Address or StringAddress.
 * @param[in]  Payload          A pointer to payload.
 * @param[in]  Size             Size of the transfer in bytes.
 * @param[in]  RespHandlerCb    Callback function called in case of confirmable message.
 *
 * @retval none.
 */
static void APP_THREAD_CoapSendRequest(otCoapResource* pCoapRessource,
    otCoapType CoapType,
    otCoapCode CoapCode,
    otIp6Address* Ip6Address,
    const char* StringAddress,
    APP_THREAD_CoapAddressTypeDef_t CoapAddressType,
    uint8_t* Payload,
    uint16_t Size,
    CoapRespHandlerCallback RespHandlerCb)
{
  otError error = OT_ERROR_NONE;
  OT_BufferIdSend = 0;

  do{
    otCoapHeaderInit(&OT_Header, CoapType, CoapCode);
    otCoapHeaderSetMessageId(&OT_Header,OT_BufferIdSend);
    otCoapHeaderGenerateToken(&OT_Header, 2U);

    error = otCoapHeaderAppendUriPathOptions(&OT_Header, pCoapRessource->mUriPath);
    if (error != OT_ERROR_NONE)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_APEND_URI,error);
    }

    if(CoapCode != OT_COAP_CODE_GET)
    {
      otCoapHeaderSetPayloadMarker(&OT_Header);
    }

    pOT_Message = otCoapNewMessage(NULL, &OT_Header);
    if (pOT_Message == NULL)
    {
      APP_THREAD_Error(ERR_THREAD_COAP_NEW_MSG,error);
      break;
    }

    if(CoapCode != OT_COAP_CODE_GET)
    {
      error = otMessageAppend(pOT_Message, Payload, Size);
      if (error != OT_ERROR_NONE)
      {
        APP_THREAD_Error(ERR_THREAD_COAP_APPEND,error);
        break;
      }
    }

    memset(&OT_MessageInfo, 0, sizeof(OT_MessageInfo));
    OT_MessageInfo.mInterfaceId = OT_NETIF_INTERFACE_ID_THREAD;
    OT_MessageInfo.mPeerPort = OT_DEFAULT_COAP_PORT;

    if(CoapAddressType == APP_THREAD_COAP_STRING_ADDRESS)
    {
      otIp6AddressFromString(StringAddress, &OT_MessageInfo.mPeerAddr);
    }
    else if (CoapAddressType == APP_THREAD_COAP_IP6_ADDRESS)
    {
      memcpy(&OT_MessageInfo.mPeerAddr, Ip6Address, sizeof(OT_MessageInfo.mPeerAddr));
    }
    else
    {
      /* ERROR : should never be in a not defined address type */
      APP_THREAD_Error(ERR_THREAD_BAD_ADDRESS_TYPE, 0);
    }

    error = otCoapSendRequest(NULL,
        pOT_Message,
        &OT_MessageInfo,
        &APP_THREAD_CoapDummyRespHandler,
        (void*)RespHandlerCb);

  }while(false);
  if (error != OT_ERROR_NONE && pOT_Message != NULL)
  {
    otMessageFree(pOT_Message);
    APP_THREAD_Error(ERR_THREAD_COAP_SEND_REQUEST,error);
  }
}

/**
 * @brief Dummy request handler
 *
 * @param None
 * @retval None
 */
static void APP_THREAD_DummyReqHandler(void            * p_context,
    otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo)
{
}

/**
 * @brief This function manages the response handler for provisioning.
 *
 * @param pHeader  header
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param Result error code
 * @retval None
 */
static void APP_THREAD_ProvisioningRespHandler(otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError             Result)
{
  if (Result == OT_ERROR_NONE)
  {
    if ((otMessageRead(pMessage, otMessageGetOffset(pMessage), &OT_Command, sizeof(OT_Command)) == sizeof(OT_Command)))
    {
      /* Retrieve the Message */
      if (otMessageRead(pMessage,
          otMessageGetOffset(pMessage) + sizeof(OT_Command),
          &OT_PeerAddress,
          sizeof(OT_PeerAddress)) != sizeof(OT_PeerAddress))
      {
        APP_THREAD_Error(ERR_THREAD_MESSAGE_READ, 0);
      }
      APP_DBG("\r -> Succesfully retrieved Remote device address \n");

      /* Notify provisioning OK */
      UTIL_SEQ_SetTask(TASK_FUOTA_PARAMETERS, CFG_SCH_PRIO_1);
    }
  }
  else
  {
    APP_DBG("WARNING: APP_THREAD_CoapDataRespHandler fail with ERROR code = %d",Result);
  }
}

/**
 * @brief This function manages the response handler for FUOTA binary datas.
 *
 * @param pHeader  header
 * @param pMessage message pointer
 * @param pMessageInfo message info pointer
 * @param Result error code
 * @retval None
 */
static void APP_THREAD_CoapRespHandlerFuotaSend(otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError             Result)
{
  if (Result == OT_ERROR_NONE)
  {
    UTIL_SEQ_SetEvt(EVENT_TRANSFER_64BITS_DONE);
  }
  else
  {
    APP_DBG("APP_THREAD_CoapRespHandlerFuotaSend : WARNING Result %d", Result);
  }
}

/**
 * @brief This function is used to handle a dummy response handler
 *
 * @param p_context  context
 * @param pHeader  coap header
 * @param pMessage message
 * @paramp pMessageInfo otMessage information
 * @param Result error status
 * @retval None
 */
static void APP_THREAD_CoapDummyRespHandler(void                * p_context,
    otCoapHeader        * pHeader,
    otMessage           * pMessage,
    const otMessageInfo * pMessageInfo,
    otError             Result)
{
  /* Prevent unused argument(s) compilation warning */
  UNUSED(p_context);
  UNUSED(pHeader);
  UNUSED(pMessage);
  UNUSED(pMessageInfo);
  UNUSED(Result);
}

/**
 * @brief Set FUOTA parameters for APP FW.
 * @param  None
 * @retval None
 */
static void APP_THREAD_FuotaSetParamApp(void)
{
  APP_THREAD_StatusTypeDef status;

  status = APP_THREAD_SetOtaContext(APP_THREAD_OTA_FILE_TYPE_FW_APP);

  if (status == APP_THREAD_OK)
  {
    APP_THREAD_FuotaProvisioning();
  }
  else
  {
    APP_DBG("WARNING: Setting Ota Context failed, do not send FUOTA PROVISIONING");
  }
}

/**
 * @brief Set FUOTA parameters for Copro Wireless FW.
 * @param  None
 * @retval None
 */
static void APP_THREAD_FuotaSetParamCoproWireless(void)
{
  APP_THREAD_StatusTypeDef status;

  status = APP_THREAD_SetOtaContext(APP_THREAD_OTA_FILE_TYPE_FW_COPRO_WIRELESS);

  if (status == APP_THREAD_OK)
  {
    APP_THREAD_FuotaProvisioning();
  }
  else
  {
    APP_DBG("WARNING: Setting Ota Context failed, do not send FUOTA PROVISIONING");
  }
}

/**
 * @brief Set Ota Context.
 * @param  None
 * @retval None
 */
static APP_THREAD_StatusTypeDef APP_THREAD_SetOtaContext(APP_THREAD_OtaFileTypeDef_t file_type)
{
  if (file_type == APP_THREAD_OTA_FILE_TYPE_FW_APP)
  {
    OtaContext.file_type = APP_THREAD_OTA_FILE_TYPE_FW_APP;
    /* Set base address for FUOTA download */
    OtaContext.base_address = FUOTA_APP_FW_BINARY_ADDRESS;
    OtaContext.magic_keyword = FUOTA_MAGIC_KEYWORD_APP;
  }
  else if (file_type == APP_THREAD_OTA_FILE_TYPE_FW_COPRO_WIRELESS)
  {
    OtaContext.file_type = APP_THREAD_OTA_FILE_TYPE_FW_COPRO_WIRELESS;
    /* Set base address for FUOTA download */
    OtaContext.base_address = FUOTA_COPRO_FW_BINARY_ADDRESS;
    OtaContext.magic_keyword = FUOTA_MAGIC_KEYWORD_COPRO_WIRELESS;
  }
  else
  {
    APP_DBG("WARNING: Unrecognized file_type = %d", file_type);
    return APP_THREAD_ERROR;
  }

  /* Set binary size */
  OtaContext.binary_size = APP_THREAD_GetBinSize();

  /* Return the function status */
  return APP_THREAD_OK;
}

/**
 * @brief Sends Provisioning request.
 * @param  None
 * @retval None
 */
static void APP_THREAD_FuotaProvisioning(void)
{
  APP_DBG("Send FUOTA PROVISONING request");

