STMicroelectronics/STM32CubeWB/Projects/P-NUCLEO-WB55.Nucleo/Applications/Thread/Thread_Ota_Server/STM32_WPAN/App/app_thread.c
  uint8_t l_provisioning_data = 0x1;

  /* Send a MULTICAST CONFIRMABLE GET Request */
  APP_THREAD_CoapSendRequest(&OT_RessourceFuotaProvisioning,
      OT_COAP_TYPE_NON_CONFIRMABLE,
      OT_COAP_CODE_GET,
      NULL,
      MULICAST_FTD_MED,
      APP_THREAD_COAP_STRING_ADDRESS,
      &l_provisioning_data,
      sizeof(l_provisioning_data),
      &APP_THREAD_ProvisioningRespHandler);
}

static uint32_t APP_THREAD_GetBinSize(void)
{
  uint32_t flash_current_offset = 0;
  uint64_t read64 = 0;
  bool binary_parsing_on_going = TRUE;
  bool error_keyword_or_size = FALSE;
  uint32_t first_secure_sector_idx;
  uint32_t maximum_reachable_offset;
  uint32_t fuota_bin_size = 0;

  first_secure_sector_idx = (READ_BIT(FLASH->SFR, FLASH_SFR_SFSA) >> FLASH_SFR_SFSA_Pos);
  APP_DBG("SFSA set to %dth sector", first_secure_sector_idx);

  /* Compute Maximum reachable address */
  maximum_reachable_offset = (first_secure_sector_idx * 0x1000) - 1;
  APP_DBG("maximum_reachable_offset =  0x%x", maximum_reachable_offset);

  while(binary_parsing_on_going == TRUE){
    read64 = *(uint64_t*)(OtaContext.base_address + flash_current_offset);

    /* Test if current word contains magic keyword */
    if((read64 & 0x00000000FFFFFFFF) == OtaContext.magic_keyword)
    {
      binary_parsing_on_going = FALSE;
    }
    else if (((read64 & 0xFFFFFFFF00000000) >> 32) == OtaContext.magic_keyword)
    {
      binary_parsing_on_going = FALSE;
    }

    flash_current_offset += 8;

    /* Test current offset is still below SFSA (Non-Secure Memory Address) */
    if(flash_current_offset > maximum_reachable_offset)
    {
      error_keyword_or_size = TRUE;
      binary_parsing_on_going = FALSE;
    }
  }

  if(error_keyword_or_size == TRUE)
  {
    APP_DBG("Error: FUOTA Keyword not found in FLASH memory, aborting!");
    APP_THREAD_Error(ERR_THREAD_FUOTA_NO_KEYWORD, 0);
  }
  else
  {
    fuota_bin_size = flash_current_offset;
  }

  return fuota_bin_size;
}

/**
 * @brief Task associated to FUOTA parameters to be sent.
 * @param  None
 * @retval None
 */
static void APP_THREAD_FuotaParameters(void)
{
  APP_DBG("FUOTA PROVISIONING OK, Set FUOTA PARAMETERS");

  if(OtaContext.file_type == APP_THREAD_OTA_FILE_TYPE_FW_APP)
  {
    APP_DBG("\r File type = FW_APP");
  }
  else  if (OtaContext.file_type == APP_THREAD_OTA_FILE_TYPE_FW_COPRO_WIRELESS)
  {
    APP_DBG("\r File type = FW_COPRO_WIRELESS");
  }
  else
  {
    APP_DBG("FUOTA_PARAMETERS: File Type not recognized");
    APP_THREAD_Error(ERR_THREAD_FUOTA_FILE_TYPE_NOT_RECOGNIZED, 0);
  }

  APP_DBG("\r Binary size = %d bytes", OtaContext.binary_size);
  APP_DBG("\r Magic keyword = 0x%x", OtaContext.magic_keyword);
  APP_DBG("\r Base address = 0x%x", OtaContext.base_address);

  /* Send a CONFIRMABLE PUT Request */
  APP_THREAD_CoapSendRequest(&OT_RessourceFuotaParameters,
      OT_COAP_TYPE_CONFIRMABLE,
      OT_COAP_CODE_PUT,
      &OT_PeerAddress,
      NULL,
      APP_THREAD_COAP_IP6_ADDRESS,
      (uint8_t*)&OtaContext,
      sizeof(OtaContext),
      &APP_THREAD_CoapRespHandlerFuotaParameters);
}

/**
 * @brief Task associated to FUOTA binary data sending.
 * @param  None
 * @retval None
 */
static void APP_THREAD_FuotaSend(void)
{
  uint32_t flash_current_offset = 0x0;
  bool binary_transfer_on_going = TRUE;
  uint32_t l_debug_count = 0;
  uint32_t l_current_index_progress = 0;
  uint32_t FuotaProgressArray[100] = {0};
  uint32_t FuotaTransferArraySize = 0;
  uint32_t l_start_transfer_time = 0;
  uint32_t l_end_transfer_time = 0;
  double l_transfer_time = 0;
  double l_transfer_throughput = 0;
  uint8_t l_Fuota_progress_multiplied = 0;

  APP_DBG("FUOTA PARAMETERS SET, START FUOTA BINARY TRANSFER");

  /* Number of elements in OtaContext.binary_size */
  FuotaTransferArraySize = OtaContext.binary_size / FUOTA_PAYLOAD_SIZE;
  APP_DBG("\r -> %d elements of %d bytes to be transferred", FuotaTransferArraySize, FUOTA_PAYLOAD_SIZE);
  if(FuotaTransferArraySize < 100)
  {
    l_Fuota_progress_multiplied = 1;
    FuotaTransferArraySize = FuotaTransferArraySize * 10;
  }
  for (int index = 1; index < 100; index++)
  {
    FuotaProgressArray[index] = (FuotaTransferArraySize / 100) * index;
  }

  l_start_transfer_time = HAL_GetTick();

  while(binary_transfer_on_going == TRUE){

    /* Get data to be sent */
    /* Read data from flash memory */
    memcpy(FuotaTransferArray, (uint8_t*)(OtaContext.base_address + flash_current_offset), FUOTA_PAYLOAD_SIZE);

    /* Send a CONFIRMABLE PUT Request */
    APP_THREAD_CoapSendRequest(&OT_RessourceFuotaSend,
        OT_COAP_TYPE_CONFIRMABLE,
        OT_COAP_CODE_PUT,
        &OT_PeerAddress,
        NULL,
        APP_THREAD_COAP_IP6_ADDRESS,
        (uint8_t*)&FuotaTransferArray,
        FUOTA_PAYLOAD_SIZE,
        &APP_THREAD_CoapRespHandlerFuotaSend);

    UTIL_SEQ_WaitEvt(EVENT_TRANSFER_64BITS_DONE);

    /* Test if magic Keyword is in FuotaTransferArray */
    for (int index = 0; index < FUOTA_NUMBER_WORDS_64BITS; ++index) {
      if((FuotaTransferArray[index] & 0x00000000FFFFFFFF) == OtaContext.magic_keyword)
      {
        APP_DBG("1 - FUOTA_MAGIC_KEYWORD found at flash_current_offset = %d", (flash_current_offset + (index*8)));
        binary_transfer_on_going = FALSE;
      }
      else
      if (((FuotaTransferArray[index] & 0xFFFFFFFF00000000) >> 32) == OtaContext.magic_keyword)
      {
        APP_DBG("2 - FUOTA_MAGIC_KEYWORD found at flash_current_offset = %d", (flash_current_offset + (index*8)));
        binary_transfer_on_going = FALSE;
      }
    }

    flash_current_offset += FUOTA_PAYLOAD_SIZE;

    /* Display Transfer Progress */
    if(l_debug_count == FuotaProgressArray[l_current_index_progress+1])
    {
      l_current_index_progress += 1;
      if(l_Fuota_progress_multiplied == 1)
      {
        APP_DBG("FUOTA Transfer %d%...", l_current_index_progress*10);
      }
      else
      {
        APP_DBG("FUOTA Transfer %d%...", l_current_index_progress);
      }
    }

    l_debug_count++;
  }

  l_end_transfer_time = HAL_GetTick();
  l_transfer_time = (double)(l_end_transfer_time - l_start_transfer_time) / 1000;
  l_transfer_throughput = (((double)OtaContext.binary_size/l_transfer_time) / 1000) * 8;

  APP_DBG("**************************************************************");
  APP_DBG(" FUOTA_SERVER : END OF TRANSFER COMPLETED");
  APP_DBG("  - Payload size = %d bytes", FUOTA_PAYLOAD_SIZE);
  APP_DBG("  - Transfer time = %.2f seconds", l_transfer_time);
  APP_DBG("  - Average throughput = %.2f kbit/s", l_transfer_throughput);
  APP_DBG("**************************************************************");

